src/main/resources/examples/updateAriaAcctPlanMultiRequest.xml

<?xml version='1.0' encoding='UTF-8'?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header/>
  <soap:Body>
    <lit:update_acct_plan_multi_m xmlns:lit="urn:client:api:wsdl:document/literal_wrapped:vers:11.0:aria_complete_m_api">
      <client_no>6000228</client_no>
      <auth_key>R3WSkfamtH9bMUrACMtm7FAtx7u8vYFy</auth_key>
      <acct_no>1819550</acct_no>
      <do_write>true</do_write>
      <assignment_directive>3</assignment_directive>
      <plan_updates>
        <plan_updates_row>
          <plan_directive>1</plan_directive>
          <new_client_plan_id>DataSite</new_client_plan_id>
          <billing_group_idx>1</billing_group_idx>
          <dunning_group_no>1181887</dunning_group_no>
          <plan_instance_idx>1</plan_instance_idx>
          <po_num xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
          <plan_instance_field_update>
            <plan_instance_field_update_row>
              <plan_instance_field_name>BILL_TO_ADDRESS_IDS</plan_instance_field_name>
              <plan_instance_field_value>169463</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>BUSINESS_UNIT</plan_instance_field_name>
              <plan_instance_field_value>Datasite</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>CONTINUATION_DATE</plan_instance_field_name>
              <plan_instance_field_value>2017-09-01</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>CONTINUATION_RATE</plan_instance_field_name>
              <plan_instance_field_value>0.06</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>CONTINUATION_RATE_SM</plan_instance_field_name>
              <plan_instance_field_value>1.1</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>CONTRACT_CUSTOMER</plan_instance_field_name>
              <plan_instance_field_value>name</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>CONTRACT_CUSTOMER_ADDRESS</plan_instance_field_name>
              <plan_instance_field_value>1 Main St St Paul MN 55101</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>CONTRACT_CUSTOMER_CONTACT</plan_instance_field_name>
              <plan_instance_field_value>Contact</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>CONTRACT_TERM</plan_instance_field_name>
              <plan_instance_field_value>1</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>COUNTRY_OF_ISSUER</plan_instance_field_name>
              <plan_instance_field_value>US</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>CURRENT_ENTITLEMENT</plan_instance_field_name>
              <plan_instance_field_value>VDR; SecureExcelViewer; QA</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>EFFECTIVE_DATE</plan_instance_field_name>
              <plan_instance_field_value>2017-08-04</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>HIBERNATION_RATE</plan_instance_field_name>
              <plan_instance_field_value>0.05</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>HIBERNATION_RATE_SM</plan_instance_field_name>
              <plan_instance_field_value>1.0</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>MEDIA_USED</plan_instance_field_name>
              <plan_instance_field_value>0</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>MEDIA_INCLUDED</plan_instance_field_name>
              <plan_instance_field_value>1.0</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>OPERATING_UNIT_NAME</plan_instance_field_name>
              <plan_instance_field_value>21-US_OU-MERRILL CORPORATION</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>PRIMARY_REP_ID</plan_instance_field_name>
              <plan_instance_field_value>21865</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>PRIMARY_REP_NAME</plan_instance_field_name>
              <plan_instance_field_value>Lori Frederick</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>PRIMARY_SERVICE_SITE</plan_instance_field_name>
              <plan_instance_field_value>STP</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>PROCESSED_FOR_CONTRACT_MINIMUM</plan_instance_field_name>
              <plan_instance_field_value>0</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>PRODUCT_TYPE</plan_instance_field_name>
              <plan_instance_field_value>Datasite-Asset Purchase</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>PROJECT_CREATION_DATE</plan_instance_field_name>
              <plan_instance_field_value>2017-08-02</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>PROJECT_PHASE</plan_instance_field_name>
              <plan_instance_field_value>Active</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>REVENUE_SITE</plan_instance_field_name>
              <plan_instance_field_value>STP</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>SALESFORCE_PROJECT_ID</plan_instance_field_name>
              <plan_instance_field_value>a27c0000005RdQLAA0</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>SALESFORCE_PROJECT_NAME</plan_instance_field_name>
              <plan_instance_field_value>MS Testing Aug 2 2</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
            <plan_instance_field_update_row>
              <plan_instance_field_name>SALESREP_SPLIT_AMOUNT</plan_instance_field_name>
              <plan_instance_field_value>Lori Frederick|21865|true|100.0</plan_instance_field_value>
              <plan_instance_field_directive>2</plan_instance_field_directive>
            </plan_instance_field_update_row>
          </plan_instance_field_update>
        </plan_updates_row>
        <plan_updates_row>
          <new_client_plan_id>Special_Media</new_client_plan_id>
          <plan_directive>1</plan_directive>
          <custom_rates>
            <custom_rates_row>
              <custom_rate_client_service_id>SMUploaded</custom_rate_client_service_id>
              <custom_rate_seq_no>1</custom_rate_seq_no>
              <custom_rate_from_unit>1</custom_rate_from_unit>
              <custom_rate_per_unit>15.0</custom_rate_per_unit>
            </custom_rates_row>
          </custom_rates>
          <plan_service_updates>
            <plan_service_updates_row>
              <client_service_id>SMUploaded</client_service_id>
              <client_svc_location_id>STP</client_svc_location_id>
            </plan_service_updates_row>
          </plan_service_updates>
          <usage_accumulation_reset_months>99</usage_accumulation_reset_months>
          <parent_plan_instance_idx>1</parent_plan_instance_idx>
        </plan_updates_row>
        <plan_updates_row>
          <new_client_plan_id>Special_Media_Hosted</new_client_plan_id>
          <plan_directive>1</plan_directive>
          <parent_plan_instance_idx>1</parent_plan_instance_idx>
          <plan_service_updates>
            <plan_service_updates_row>
              <client_service_id>SMHosted</client_service_id>
              <client_svc_location_id>STP</client_svc_location_id>
            </plan_service_updates_row>
          </plan_service_updates>
        </plan_updates_row>
        <plan_updates_row>
          <new_client_plan_id>Pages_Uploaded</new_client_plan_id>
          <plan_directive>1</plan_directive>
          <parent_plan_instance_idx>1</parent_plan_instance_idx>
          <custom_rates>
            <custom_rates_row>
              <custom_rate_client_service_id>PgMinimumFee</custom_rate_client_service_id>
              <custom_rate_seq_no>1</custom_rate_seq_no>
              <custom_rate_from_unit>1</custom_rate_from_unit>
              <custom_rate_per_unit>500.0</custom_rate_per_unit>
            </custom_rates_row>
            <custom_rates_row>
              <custom_rate_client_service_id>PgUploaded</custom_rate_client_service_id>
              <custom_rate_seq_no>1</custom_rate_seq_no>
              <custom_rate_from_unit>1</custom_rate_from_unit>
              <custom_rate_to_unit>500.0</custom_rate_to_unit>
              <custom_rate_per_unit>0.04</custom_rate_per_unit>
            </custom_rates_row>
            <custom_rates_row>
              <custom_rate_client_service_id>PgUploaded</custom_rate_client_service_id>
              <custom_rate_seq_no>2</custom_rate_seq_no>
              <custom_rate_from_unit>501.0</custom_rate_from_unit>
              <custom_rate_to_unit>1000.0</custom_rate_to_unit>
              <custom_rate_per_unit>0.03</custom_rate_per_unit>
            </custom_rates_row>
            <custom_rates_row>
              <custom_rate_client_service_id>PgUploaded</custom_rate_client_service_id>
              <custom_rate_seq_no>3</custom_rate_seq_no>
              <custom_rate_from_unit>1001.0</custom_rate_from_unit>
              <custom_rate_to_unit xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
              <custom_rate_per_unit>0.02</custom_rate_per_unit>
            </custom_rates_row>
          </custom_rates>
          <plan_service_updates>
            <plan_service_updates_row>
              <client_service_id>PgUploaded</client_service_id>
              <client_svc_location_id>STP</client_svc_location_id>
            </plan_service_updates_row>
            <plan_service_updates_row>
              <client_service_id>PgMinimumFee</client_service_id>
              <client_svc_location_id>STP</client_svc_location_id>
            </plan_service_updates_row>
          </plan_service_updates>
        </plan_updates_row>
        <plan_updates_row>
          <new_client_plan_id>MBs_Uploaded</new_client_plan_id>
          <plan_directive>1</plan_directive>
          <parent_plan_instance_idx>1</parent_plan_instance_idx>
          <plan_service_updates>
            <plan_service_updates_row>
              <client_service_id>MBUploaded</client_service_id>
              <client_svc_location_id>STP</client_svc_location_id>
            </plan_service_updates_row>
            <plan_service_updates_row>
              <client_service_id>MBMinimumFee</client_service_id>
              <client_svc_location_id>STP</client_svc_location_id>
            </plan_service_updates_row>
          </plan_service_updates>
        </plan_updates_row>
        <plan_updates_row>
          <new_client_plan_id>GBs_Uploaded</new_client_plan_id>
          <plan_directive>1</plan_directive>
          <parent_plan_instance_idx>1</parent_plan_instance_idx>
          <plan_service_updates>
            <plan_service_updates_row>
              <client_service_id>GBUploaded</client_service_id>
              <client_svc_location_id>STP</client_svc_location_id>
            </plan_service_updates_row>
          </plan_service_updates>
          <plan_service_updates_row>
            <client_service_id>GBMinimumFee</client_service_id>
            <client_svc_location_id>STP</client_svc_location_id>
          </plan_service_updates_row>
        </plan_updates_row>
        <plan_updates_row>
          <new_client_plan_id>Pages_Hosted</new_client_plan_id>
          <plan_directive>1</plan_directive>
          <plan_service_updates>
            <plan_service_updates_row>
              <client_service_id>PgHosted</client_service_id>
              <client_svc_location_id>STP</client_svc_location_id>
            </plan_service_updates_row>
          </plan_service_updates>
          <parent_plan_instance_idx>1</parent_plan_instance_idx>
        </plan_updates_row>
        <plan_updates_row>
          <new_client_plan_id>MBs_Hosted</new_client_plan_id>
          <plan_directive>1</plan_directive>
          <parent_plan_instance_idx>1</parent_plan_instance_idx>
          <plan_service_updates>
            <plan_service_updates_row>
              <client_service_id>MBHosted</client_service_id>
              <client_svc_location_id>STP</client_svc_location_id>
            </plan_service_updates_row>
          </plan_service_updates>
        </plan_updates_row>
        <plan_updates_row>
          <new_client_plan_id>GBs_Hosted</new_client_plan_id>
          <plan_directive>1</plan_directive>
          <parent_plan_instance_idx>1</parent_plan_instance_idx>
          <plan_service_updates>
            <plan_service_updates_row>
              <client_service_id>GBHosted</client_service_id>
              <client_svc_location_id>STP</client_svc_location_id>
            </plan_service_updates_row>
          </plan_service_updates>
        </plan_updates_row>
      </plan_updates>
      <acct_billing_groups>
        <acct_billing_groups_row>
          <billing_group_directive>1</billing_group_directive>
          <billing_group_name>a27c0000005RdQLAA0</billing_group_name>
          <billing_group_idx>1</billing_group_idx>
          <statement_template>60002281</statement_template>
          <credit_note_template>60002282</credit_note_template>
          <credit_memo_template>60002283</credit_memo_template>
          <rebill_template>60002284</rebill_template>
          <stmt_contact_idx>1</stmt_contact_idx>
        </acct_billing_groups_row>
      </acct_billing_groups>
      <contacts>
        <contacts_row>
          <contact_idx>1</contact_idx>
          <first_name>T</first_name>
          <last_name>Brown</last_name>
          <company_name>Cargill Incorporated</company_name>
          <address1>15407 McGinty Rd W</address1>
          <address2 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
          <address3 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
          <city>Wayzata</city>
          <locality xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
          <state_prov>MN</state_prov>
          <country>US</country>
          <postal_cd>55391</postal_cd>
          <phone xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true" />
          <email>t@gmail.com</email>
        </contacts_row>
      </contacts>
    </lit:update_acct_plan_multi_m>
  </soap:Body>
</soap:Envelope>